Repository: khanhhehehe/planet_defender
Catalog: packages/localizations/lib/l10n/app_*.arb
Languages: vi

source: Login
vi: Đăng nhập

# loginUsername
source: User name
vi: Tên đăng nhập

# loginPassword
source: Password
vi: Mật khẩu

# loginEmail
source: Sign in with Email
vi: Đăng nhập với Gmail

# loginForgotPassword
source: Forgot password
vi: Quên mật khẩu

# loginFaceId
source: Sign in with Face ID
vi: Đăng nhập bằng Face ID

# loginWithAnother
source: Sign in with another form
vi: Đăng nhập bằng hình thức khác

# loginNow
source: Sign in now
vi: Đăng nhập ngay

# loginNotMember
source: Not a member?
vi: Không phải thành viên?

# loginFalseNamePass
source: Error email or password
vi: Sai tên hoặc mật khẩu

source: Sign Up Success
vi: Đăng ký ngay

source: Sign up now
vi: Xác nhận

# signupConfirm
source: Confirm
vi: Chưa nhận được mã?

# signupRetryOtpMessage
source: Haven't received the code yet?
vi: Gửi lại OTP

# signupRetryOtp
source: Resend OTP
vi: Đăng ký với số điện thoại

source: Sign up with phone number
vi: Bạn đã là thành viên?

# signupMember
source: Already a member?
vi: Đăng ký

source: Sign up
vi: Đăng ký với email

source: Sign up with email
vi: Google

# signupGoogle
source: Google
vi: Facebook

# signupFacebook
source: Facebook
vi: Đăng ký với OTP

# signupUsername
source: Username
vi: Email

# signupEmail
source: Email
vi: Apple

# signupApple
source: Apple
vi: Xác nhận mật khẩu

# signupConfirmPassword
source: Confirm password
vi: Mã giới thiệu

# signupReferralCode
source: Referral code
vi: +84 | Số điện thoại

# signupPhoneNumber
source: +84 | Phone number
vi: Khi đăng ký trên FSEL, bạn đã đồng ý với các chính sách và Chính sách bảo mật của chúng tôi

# signupFooterByfsel
source: By registering on FSEL, you agree to our policies and Privacy Policy
vi: Đăng ký bằng hình thức khác

# signupFooterRegisterForm
source: Register in another form
vi: Hoặc

# signupOr
source: Or
vi: Phụ Huynh

# signupParent
source: Parent
vi: Học Sinh

# signupChild
source: Student
vi: Thông tin con của bạn

# signupChildInformation
source: Your child's information
vi: Họ và tên

# signupAccountChildName
source: full Name
vi: Trường

# signupAccountChildSchool
source: School
vi: Tạo

# signupCreate
source: Create
vi: Tên đăng nhập

# signupAccountChildUserName
source: User name
vi: Mật khẩu

# signupAccountChildPass
source: Password
vi: Xác nhận mật khẩu

# signupAccountChildConfirmPass
source: Confirm password
vi: Họ và tên

# signupEmailFullName
source: Full name
vi: Mật khẩu

# signupEmailPassword
source: Password
vi: Youtube

# surveyYoutube
source: Youtube
vi: Tiktok

# surveyTiktok
source: Tiktok
vi: Bạn bè/gia đình

# surveyFriendsFamily
source: Friends/Family
vi: Tin tức/báo chí/blog

# surveyNewspapers
source: News/newspapers/blogs
vi: Khác

# surveyDifferent
source: Different
vi: Tivi

# surveyTivi
source: Tivi
vi: Bạn biết đến FSEL từ đâu?

# surveyTitleSocial
source: Where did you hear about FSEL?
vi: Khảo sát

# surveyTitleSurveypage
source: Survey
vi: Chọn hướng đi của bạn

# surveyTitleBackage
source: Choose your direction
vi: Vị trí của bạn?

# surveyTitleReason
source: Why are you learning a foreign language?
vi: Tại sao bạn học ngoại ngữ?

# surveyTitleLocation
source: Your location?
vi: Xác định độ tuổi và giới tính

# surveyTitleAge
source: Determination of age and gender
vi: Bạn đã biết một chút Tiếng Anh

# surveyBackageKnowEnglish
source: You already know a little English
vi: Đây là lần đầu bạn học Tiếng Anh

# surveyBackageFirstLearningEnglish
source: This is your first time learning English
vi: Văn hóa

# surveyReasonCulture
source: Culture
vi: Du lịch

# surveyReasonTravel
source: Travel
vi: Kết bạn và chia sẻ

# surveyReasonMakeFriends
source: Make friends and share
vi: Học tập

# surveyReasonLearning
source: Learn
vi: Cơ hội nghề nghiệp

# surveyReasonCareers
source: Job Opportunities
vi: Quốc gia

# surveyLocationCountry
source: Country
vi: Tỉnh/Thành phố

# surveyLocationCity
source: Province/City
vi: Trước khi bắt đầu, hãy hoàn thành bài khảo sát để FSEL hiểu thêm về bạn nhé!

# surveyTextSurveypage
source: Before you begin, complete the survey to help FSEL learn more about you!
vi: Bắt đầu

# surveyGetStarted
source: Get started
vi: Hoàn thành

# surveyComplete
source: Complete
vi: Nam

# surveyAgeBoy
source: Boy
vi: Nữ

# surveyAgeGirl
source: Girl
vi: Ngày

# surveyAgeDay
source: Date
vi: Năm

# surveyAgeYear
source: Year
vi: Tháng

# surveyAgeMonth
source: Month
vi: Google

# surveyGoogle
source: Google
vi: Facebook

# surveyFacebook
source: Facebook
vi: Khảo sát

source: Survey
vi: Trường dữ liệu bắt buộc

# errorEmpty
source: Required data field
vi: Sai định dạng mật khẩu

# errorPassFormat
source: Error password format
vi: mật khẩu và xác nhận mật khẩu không trùng khớp

# errorConfirmPassword
source: Password and confirm password are not the same
vi: Sai định dạng Email

source: Error email format
vi: Lỗi dữ liệu

source: Error phone format
vi: Sai định dạng số điện thoại

source: Error data
vi: Mật Khẩu Mới

# forgotNewPassword
source: New passWord
vi: xác nhận mật khẩu

# forgotConfirmPassword
source: Confirm password
vi: Email hoặc Số điện thoại

# forgotEmailOrPhone
source: Email or Phone number
vi: Xác nhận

# forgotButtonConfirm
source: Confirm
vi: Gửi OTP

# forgotTitleChangePassword
source: Change password
vi: Mật khẩu mới

# forgotTitleForgotPassword
source: Forgot password ?
vi: Quên mật khẩu ?

# forgotButtonSendOtp
source: Send OTP
vi: Kết quả

# resultTitle
source: Result
vi: Câu trả lời đúng

# resultCorrectAnswers
source: Correct Answers
vi: Phần thưởng:

# resultTokenReward
source: Token reward:
vi: Chúng ta hãy thử lại một lần nữa, phải không?

# resultAgainOneMoreTime
source: Let’s try again one more time, shall we?
vi: Chúc mừng, bạn đã hoàn thành!

# resultDoneMessage
source: You did it! Congrats!
vi: Xem chi tiết

# resultViewDetail
source: View detail
vi: Thử lại

# resultTryAgain
source: Try again
vi: Xác Nhận

source: Personal Info
vi: Thông tin cá nhân

# personalProgress
source: Progress
vi: Thông tin học sinh

# personalQuestBoard
source: Quest broad
vi: Thông tin phụ huynh

# personalCalendar
source: Calendar
vi: Tiến trình

# personalSetting
source: Settings & Privacy
vi: Nhiệm vụ

# personalFeedback
source: Give Feedback
vi: Lịch

# personalProfile
source: Switch Profiles
vi: Cài đặt và quyền riêng tư

# personalInfoStudentTitle
source: Student Information
vi: Phản hồi

# personalInfoParentTitle
source: Parent Information
vi: Hồ Sơ

# personalInfoStudentFullName
source: Full name
vi: Họ và tên

# personalInfoStudentDOB
source: DOB
vi: Ngày sinh

# personalInfoStudentPhone
source: Phone No
vi: Số điện Thoại

# personalInfoStudentStudentId
source: Student ID
vi: ID học sinh

# personalInfoStudentAddress
source: Address
vi: Địa chỉ

# personalInfoStudentOccupation
source: Occupation
vi: Nghề nghiệp

# personalInfoStudentClassId
source: Class ID
vi: ID lớp

# personalInfoStudentSchool
source: School
vi: Trường

# personalInfoParentFullName
source: Full name
vi: Họ và tên

# personalInfoParentPhone
source: Phone No
vi: Số điện Thoại

# personalInfoParentDOB
source: DBO
vi: Ngày sinh

# personalInfoParentOccupation
source: Occupation
vi: Nghề nghiệp

# personalInfoParentAddress
source: Address
vi: Địa chỉ

# personalInfoStudent
source: For Student
vi: Học sinh

# personalInfoParent
source: For parent/guardian
vi: Phụ huynh/người giám hộ

# personalInfoReferralCode
source: Referral code
vi: Mã giới thiệu

# personalEditFullName
source: Full Name:
vi: Họ và tên:

# personalEditDOB
source: DOB:
vi: Ngày sinh:

# personalEditPhone
source: Phone No:
vi: Số điện thoại:

# personalEditAddress
source: Address:
vi: Địa chỉ:

# personalEditSchool
source: School:
vi: Trường học:

# personalEditVerifying
source: (Verifying)
vi: (Đang xác thực)

# personalEditOccupation
source: Occupation:
vi: Nghề nghiệp:

# personalEditBtnChange
source: Save change
vi: Lưu thay đổi

# personaVerifyEmailTitle
source: Verify email
vi: Xác thực email

# personaVerifyEmailChangeByEnter
source: You can change by entering another email
vi: Bạn có thể thay đổi bằng cách nhập email khác

# personaVerifyEmailNote
source: You must check your email to complete the confirmation. If you have not received the email, please check your spam folder or click the button below
vi: Bạn phải kiểm tra email của mình để hoàn tất xác nhận. Nếu bạn chưa nhận được email, vui lòng kiểm tra thư mục thư rác hoặc nhấp vào nút bên dưới

# personaVerifyEmailBtn
source: Send email verify
vi: Gửi xác thực tới email

# personaVerifyPhoneBtn
source: Send me the code
vi: Gửi mã cho tôi

# personaVerifyPhoneTitle
source: Add phone number
vi: Thêm số điện thoại

# personaVerifyPhoneSentOtpYou
source: We will send an otp Verification to you
vi: Chúng tôi sẽ gửi mã xác thực cho bạn

# parent
source: Phụ Huynh
vi: Đăng ký thành công

# children
source: Học Sinh
vi: Phụ Huynh

# unitContinue
source: Continue
vi: Học Sinh

# actionContinue
source: Continue
vi: Tiếp tục

# actionBackToLesson
source: Back to lesson
vi: Tiếp tục

# notData
source: Không tìm thấy dữ liệu phù hợp
vi: Quay lại bài học

# name
source: Tên
vi: Không tìm thấy dữ liệu phù hợp

# school
source: Trường
vi: Tên

# create
source: Tạo
vi: Trường

# childInformation
source: Thông tin con của bạn
vi: Tạo

# errorForgotPassword
source: Sai Email hoặc SĐT
vi: Thông tin con của bạn

source: New password
vi: Mật khẩu mới

# emailOrPassword
source: Email hoặc PassWord
vi: Mật Khẩu Mới

# accept
source: Đồng ý
vi: Email hoặc PassWord

# dialogLogoutTitle
source: Phiên đăng nhập đã hết hạn. Vui lòng đăng nhập lại để tiếp tục
vi: Đồng ý

# dialogTitle
source: Confirm
vi: Phiên đăng nhập đã hết hạn. Vui lòng đăng nhập lại để tiếp tục

# dialogConfirmOk
source: Yes
vi: Đồng ý

# dialogConfirmNo
source: No
vi: Huỷ

# settingNotify
source: Notify setting
vi: Cài đặt thông báo

# settingNotifyGame
source: Game/High teach notification
vi: Thông báo Game/High tech

# settingNotifyFeedback
source: Feedback notification
vi: Thông báo phản hồi

# settingNotifyLiveClass
source: Live class notification
vi: Thông báo lớp học

# settingNotifyForumPost
source: Forum post notification
vi: thông báo diễn đàn

# settingChangePass
source: Change password
vi: Thay đổi mật khẩu

# settingLanguage
source: Language
vi: Ngôn ngữ

# settingHelp
source: Help & Support
vi: Trợ giúp

# settingFAQ
source: FAQ
vi: Câu hỏi thường gặp

# settingSupportTicket
source: Support ticket
vi: Trợ giúp ticket

# settingCache
source: Cache
vi: Bộ nhớ đệm

# settingVersion
source: Version
vi: Phiên bản

# settingPrivacy
source: Privacy policy
vi: Chính sách bảo mật

# settingTerms
source: Terms of use
vi: Điểu khoản sử dụng

# settingLogout
source: Log out
vi: Đăng xuất

# settingDelete
source: Delete
vi: xoá

# settingTitle
source: Settings & Privacy
vi: Cài đặt và quyền riêng tư

source: Change password
vi: Thay đổi mật khẩu

# changeCurrentPass
source: Current Password
vi: Mật khẩu cũ

# changeNewPass
source: New password
vi: Mật khẩu mới

# changeConfirmPass
source: Confirm new password
vi: Nhập lại mật khẩu

# changeButton
source: Change password
vi: Thay đổi mật khẩu

# changeForgotPass
source: Forgot password?
vi: Quên mật khẩu?

# changeForgotPlease
source: Please enter the email you used to register your account, we can help you recover your password
vi: Vui lòng nhập email bạn đã sử dụng để đăng ký tài khoản, chúng tôi có thể giúp bạn lấy lại mật khẩu

# changeForgotSendOtp
source: Send OTP
vi: Gửi OTP

# changeConfirmEmail
source: Confirm email
vi: Xác nhận email

# changeConfirmEnter
source: Enter the code we sent to the email
vi: Nhập mã chúng tôi gửi về Email

# changeConfirmButton
source: Confirm
vi: Xác nhận

# changeConfirmSendCode
source: Send code again
vi: Gửi lại OTP

# introductionPtTest
source: Are you ready to take the Test to check your current level before taking the official course?
vi: Bạn đã sẵn sàng đến với bài Test để kiểm tra trình độ hiện tại trước khi tham gia khóa học chính thức

# chooseTest
source: Which course would you like to join? Please choose correctly so that the system gives the appropriate entrance test!
vi: Bạn muốn tham gia khóa học nào? Hãy lựa chọn chính xác để hệ thống đưa ra bài kiểm tra đầu vào phù hợp!

# errorCurrentPass
source: old password is incorrect
vi: Mật Khẩu cũ không đúng

# ready
source: I'm ready
vi: Tôi đã sẵn sàng

source: Back to choose course
vi: Quay lại chọn khóa học

source: View report
vi: Xem báo cáo

source: Complete Lesson
vi: Hoàn thành

source: Review Lesson
vi: Xem lại bài

source: Resume Lesson
vi: Tiếp tục lại

# allQuestionNotFill
source: You must answer all questions before submit !
vi: Bạn cần phải điền toàn bộ câu hỏi trước khi submit

# progressAboutFsel
source: How do you feel about FSEL?
vi: Bạn cảm thấy thế nào về FSEL?

# progressReceivedYourFeedback
source: It would be great if FSEL received your feedback on improving service quality
vi: Thật tuyệt vời nếu FSEL nhận được phản hồi của các bạn về việc nâng cao chất lượng dịch vụ

# homeLessonOverview
source: Lesson overview
vi: Tổng quan bài học

source: Information
vi: Thông tin

source: Diary
vi: Nhật ký

source: Current rating
vi: Xếp hạng hiện tại

source: View all
vi: Xem tất cả

source: Top
vi: Hạng

source: Soundtrack
vi: Nhạc nền

source: Sound effects
vi: Hiệu ứng âm thanh

source: Graphics quality
vi: Chất lượng đồ họa

source: Vibrate
vi: Rung

source: Link accounts
vi: Liên kết tài khoản

source: Account Settings
vi: Cài đặt tài khoản

source: Delete data
vi: Xóa dữ liệu

source: Back
vi: Trở lại

source: Academic level
vi: Trình độ học thuật

source: Academic
vi: Học thuật

source: Confirm
vi: Xác nhận

source: Setting
vi: Cài đặt

source: Guest account
vi: Tài khoản khách

source: Log out
vi: Đăng xuất

# doYouWantToLogout
source: Are you sure you want to sign out of this account?
vi: Bạn có chắc chắn muốn đăng xuất khỏi tài khoản này không?

# doYouWantDeleteData
source: Your data will be permanently deleted. Do you want to continue?
vi: Dữ liệu của bạn sẽ bị xóa vĩnh viễn. Bạn có muốn tiếp tục?

source: Cancel
vi: Hủy

source: Warning
vi: Cảnh báo

# doYouWantToChangeLevelAcademic
source: Changing your academic level will immediately reset your rating to 0. Are you sure you want to change?
vi: Thay đổi trình độ học thuật sẽ lập tức reset điểm ranking về 0. Bạn chắc chắn muốn thay đổi chứ?

source: Start game
vi: Bắt đầu

# tooltipAcademic
source: This content is for students studying general English for educational purposes. It is divided into 6 levels, from beginner to advanced.
vi: Nội dung này dành cho sinh viên học tiếng Anh tổng quát vì mục đích giáo dục. Nó được chia thành 6 cấp độ, từ cơ bản đến nâng cao.

# tooltipIelts
source: This content is for students preparing for the official IELTS exam. It is divided into 3 levels based on the target band score the learner wishes to achieve on the exam.
vi: Nội dung này dành cho học viên chuẩn bị cho kỳ thi IELTS chính thức. Nó được chia thành 3 cấp độ dựa trên điểm số mục tiêu mà người học mong muốn đạt được trong kỳ thi.

# doYouWantToChangeAcademicLevel
source: Changing your academic level will immediately reset your ranking score to 0. Are you sure you want to change?
vi: Thay đổi trình độ học thuật sẽ lập tức reset điểm ranking về 0. Bạn chắc chắn muốn thay đổi chứ?

source: Current password
vi: Mật khẩu hiện tại

source: Confirm password
vi: Xác nhận mật khẩu

# passwordCodition
source: *Password must have at least 8 characters (Including 1 capital letter, 1 number and 1 special character)
vi: *Mật khẩu phải có ít nhất 8 ký tự (Bao gồm 1 ký tự in hoa, 1 số và 1 ký tự đặc biệt)

# changePassSuccessful
source: You have successfully changed your password. Press back to return to settings or, the screen will close automatically later
vi: Bạn đã thay đổi mật khẩu thành công. Bấm trở lại để quay về cài đặt hoặc, màn hình sẽ tự đóng lại sau

source: Success
vi: Thành công

source: Link account
vi: Liên kết tài khoản

source: Link
vi: Liên kết

source: Create account
vi: Tạo tài khoản

source: Account doesn’t exist
vi: Tài khoản không tồn tại

# selectAccount1
source: We noticed your account exists
vi: Chúng tôi nhận thấy tài khoản của bạn đang tồn tại

# selectAccount2
source: data sources. Please select a data source to continue.
vi: nguồn dữ liệu. Vui lòng chọn một nguồn dữ liệu để tiếp tục.

source: Level
vi: Cấp

# linkAccountSuccess
source: You have successfully linked your account. Click restart to refresh data. The system will automatically reboot later
vi: Bạn đã liên kết tài khoản thành công. Bấm vào khởi động lại để làm mới dữ liệu. Hệ thống sẽ tự động khởi động lại sau

source: Restart
vi: Khởi động lại
